.doom.d/config/config.org
#+Title: Emacs Config From scratch
#+AUTHOR: Ianedmosz
#+DESCRIPTION: Pls just work on your ass


* Font Stuff

#+begin_src emacs-lisp

(setq doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 18))
;; Set the background transparency for the currently selected frame
;;(set-frame-parameter nil 'alpha-background 95)

;; Set the background transparency for all new frames that are created
;;(add-to-list 'default-frame-alist '(alpha-background . 95))


#+end_src

* Icons
#+begin_src emacs-lisp

(require 'nerd-icons)

(add-hook 'java-mode-hook (lambda () (setq lsp-headerline-breadcrumb-enable nil)))
(add-hook 'python-mode-hook (lambda () (setq lsp-headerline-breadcrumb-enable nil)))

#+end_src
* Treesit
#+begin_src emacs-lisp
(add-hook 'rust-mode-hook #'tree-sitter-mode)

(add-hook 'C-mode-hook #'tree-sitter-mode)

(add-hook 'python-mode-hook #'tree-sitter-mode)

(add-hook 'java-mode-hook #'tree-sitter-mode)

(add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode)

(setq major-mode-remap-alist
      (append
       '((c-mode . c-ts-mode)
         (c++-mode . c++-ts-mode)
         (java-mode . java-ts-mode)
         (rust-mode . rust-ts-mode)
         (python-mode . python-ts-mode))
       major-mode-remap-alist))


#+end_src




* Lsp
#+begin_src emacs-lisp
;;(setq lsp-semantic-tokens-enable t)
;;(after! lsp-mode
  ;;(setq lsp-semantic-tokens-enable t)
  ;;(setq lsp-enable-semantic-highlighting t))



(global-flycheck-mode +1)

(after! lsp-mode
  (setq lsp-semantic-tokens-enable nil
    ;;    lsp-enable-semantic-highlighting t
        lsp-auto-guess-root t
        lsp-headerline-breadcrumb-enable nil
        lsp-enable-snippet t
        lsp-modeline-diagnostics-enable t
        lsp-signature-auto-activate t
        lsp-signature-render-documentation t))

#+end_src
** Eglot
#+begin_src emacs-lisp
#+end_src
#+RESULTS:
| doom-modeline-env-setup-rust | eglot-ensure | lsp-deferred |

** LSP PYTHON
#+begin_src emacs-lisp
(use-package lsp-pyright
    :hook (python-mode . (lambda ()
                          (require 'lsp-pyright)
                          (lsp-deferred))))

(let ((npm-global-bin (expand-file-name "~/.npm-global/bin")))
  (setenv "PATH" (concat npm-global-bin ":" (getenv "PATH")))
  (add-to-list 'exec-path npm-global-bin))

(after! lsp-mode
  (setq lsp-auto-guess-root t
        lsp-headerline-breadcrumb-enable t
        lsp-enable-snippet t))

(dolist (mode '(python-mode python-ts-mode java-mode rust-mode))
  (add-hook (intern (concat (symbol-name mode) "-hook")) #'lsp-deferred))


(dolist (mode '(c-mode c++-mode c-ts-mode c++-ts-mode))
  (add-hook (intern (concat (symbol-name mode) "-hook")) #'lsp-deferred))

(after! lsp-mode
  (setq lsp-enable-on-type-formatting nil
        lsp-enable-indentation nil))

#+end_src




#+RESULTS:

** Lsp ui
#+begin_src emacs-lisp

(setq lsp-ui-doc-enable t)
(setq lsp-ui-doc-show-with-mouse t)


#+end_src


*** Bread Crumbs
#+begin_src emacs-lisp

(after! lsp-mode
  (setq lsp-headerline-breadcrumb-enable nil))

#+end_src

#+RESULTS:
: t

** Flycheck

#+begin_src emacs-lisp
  (setq flycheck-display-errors-delay 0.1
        flycheck-indication-mode 'left-fringe
        flycheck-highlighting-mode 'lines
        flycheck-global-modes '(not org-mode text-mode)
        flycheck-check-syntax-automatically '(save mode-enabled))

(add-hook 'after-init-hook #'global-flycheck-mode)


(setq flycheck-check-syntax-automatically '(save mode-enabled idle-change new-line)
      flycheck-idle-change-delay 0.5
      flycheck-display-errors-delay 0.1)

#+end_src

    #+RESULTS:
    : 0.1


* Emacs Style

** Line Numbers
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
(setq org-directory "~/org/")
#+end_src

** Style
#+begin_src emacs-lisp
  (doom-themes-treemacs-config)
(doom-themes-org-config)
#+end_src



#+RESULTS:
: relative

** My temas
#+begin_src emacs-lisp
;; Optional: Set the flavor (e.g., 'latte, 'frappe, 'macchiato, 'mocha)
(setq catppuccin-flavor 'mocha)

(setq doom-theme 'catppuccin)
#+end_src

#+RESULTS:
: doom-one

** Org Modern
#+begin_src emacs-lisp
(add-hook 'org-mode-hook #'(lambda () (display-line-numbers-mode 0)))

  (use-package org-modern
  :hook ((org-mode . org-modern-mode)
         (org-agenda-finalize . org-modern-agenda))
  :config
  (setq
    org-auto-align-tags nil
    org-tags-column 0
    org-catch-invisible-edits 'show-and-error
    org-special-ctrl-a/e t
    org-insert-heading-respect-content t
    org-hide-emphasis-markers t
    org-pretty-entities t
    org-agenda-tags-column 0
    org-ellipsis "…"
    org-modern-star '("●" "○" "◉" "◇" "◆"))
  )


  (set-face-attribute 'default nil
                      :family "JetBrains Mono"
                      :height 120)

  (with-eval-after-load 'org
    (global-org-modern-mode))


(global-org-modern-mode)

#+end_src

* Company
#+begin_src emacs-lisp

(add-hook 'after-init-hook 'global-company-mode)
(setq company-backends '(company-files))

(setq company-backends '((company-capf :with company-files)))

(set-company-backend! 'org-mode '(company-files company-capf))


#+end_src
